export default function CopyrightStatement() {
  return (
    <>
      <h2 className='page-title'>著作權聲明</h2>
      <div className='copyright-statement content-layout container'>
        <h2>一、本站著作權聲明</h2>
        <ol>
          <li>
            本站刊載之所有內容，除著作權法規定不得為著作權之標的（如法律、命令、公務員撰擬之講稿、新聞稿等－請參考著作權法第
            9
            條規定）外，其他包括文字敘述、攝影、圖片、錄音、影像及其他資訊，均受著作權法保護。
          </li>
          <li>
            上述不得為著作權標的者，任何人均得自由利用，歡迎各界廣為利用。
          </li>
          <li>
            本站資訊內容受著作權法保護者，除有合理使用情形外，應取得該著作財產權人同意或授權後，方得利用。
          </li>
          <li>
            上述「合理使用情形」，說明如下：
            <ol>
              <li>
                本站上所刊載以本站名義公開發表之著作，即著作人為本站者，在合理範圍內，得重製、公開播送或公開傳輸，利用時，並請註明出處。
              </li>
              <li>
                為報導、評論、教學、研究或其他正當目的，在合理範圍內，得引用本站上之資訊，引用時，並請註明出處。
              </li>
              <li>
                其他合理使用情形，請參考著作權法第四十四條至第六十五條之規定。
              </li>
            </ol>
          </li>
        </ol>
        <h2>二、連結至本站</h2>
        <p>
          一般而言，任何網站連結至本站，毋須經過本站同意，然而連結須明白標示本站名稱，若是連結會誤導使用者，本站將不允許此連結行為。
        </p>
        <h2>三、本站之相關連結</h2>
        <p>
          為供網路使用者便利，本站僅提供相關網站之連結，對利用人涉及該網站內容之使用行為，本站不負責任。
        </p>
        <h2>四、免責聲明</h2>
        <p>
          本站所提供相關連結網站之網頁或資料，均為被連結網站所提供，相關權利為該等網站或合法權利人所有，本站不擔保其正確性、即時性或完整性。
        </p>
        <h2>五、關於圖片與描述使用說明</h2>
        <ol>
          <li>
            本站的所有畫作圖片均來自於
            <a
              className='text-color-blue d-inline-block'
              href='https://www.nga.gov/notices/open-access-policy.html'
              target='_blank'
            >
              【華盛頓國家藝廊】
            </a>
            並根據其提供的 CC0 公眾領域授權使用。
          </li>
          <li>
            關於畫作的文字描述則由 ChatGPT
            生成，這些描述可能會包含不準確或錯誤的內容，僅供參考使用。如需更詳盡或準確的資訊，建議參考官方或學術資源。
          </li>
        </ol>
      </div>
    </>
  );
}
